src/cf/DataProcessors/ПомощникНастройкиКассовогоМестаРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникНастройкиКассовогоМестаРМК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РабочееМестоРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассаККМРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаККМРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКассы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипКассыРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодключаемоеОборудование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПодключаемоеОборудованиеРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонЧекаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьБезПодключенияОборудования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаЛенты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонЧекаККМВозврат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодключаемоеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОборудования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипПодключаемогоОборудованияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДрайверОборудованияПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДрайверОборудованияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодключаемоеОборудование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПодключаемоеОборудованиеРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнениеОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПодключенияОборудования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипПодключенияОборудованияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Кассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаККМРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробиватьЧекиПоКассеККМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несертифицируемое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ПомощникНастройкиКассовогоМестаРМК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СоответствиеЗаголовка Экспорт; // Хранит заголовки страниц
Перем СоответствиеОкончанияНаименования Экспорт; // Хранит окончания наименования заголовков страниц.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура заполнения соответствий наименований типов оборудования.
//
Процедура ЗаполнитьСоответствияСообщений() Экспорт
	
	ТипыОборудования = Перечисления.ТипыПодключаемогоОборудования;
	
	СоответствиеЗаголовка = Новый Соответствие;
	СоответствиеЗаголовка.Вставить(ТипыОборудования.СканерШтрихкода, НСтр("ru = 'Сканер штрихкодов'"));
	СоответствиеЗаголовка.Вставить(ТипыОборудования.СчитывательМагнитныхКарт, НСтр("ru = 'Считыватель магнитных карт'"));
	СоответствиеЗаголовка.Вставить(ТипыОборудования.ФискальныйРегистратор, НСтр("ru = 'Фискальный регистратор'"));
	СоответствиеЗаголовка.Вставить(ТипыОборудования.ПринтерЧеков, НСтр("ru = 'Принтер чеков'"));
	СоответствиеЗаголовка.Вставить(ТипыОборудования.ЭквайринговыйТерминал, НСтр("ru = 'Эквайринговый терминал'"));
	СоответствиеЗаголовка.Вставить(ТипыОборудования.ДисплейПокупателя, НСтр("ru = 'Дисплей покупателя'"));
	СоответствиеЗаголовка.Вставить(ТипыОборудования.ЭлектронныеВесы, НСтр("ru = 'Электронные весы (online)'"));
	
	СоответствиеОкончанияНаименования = Новый Соответствие;
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.СканерШтрихкода, НСтр("ru = 'сканер'"));
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.СчитывательМагнитныхКарт, НСтр("ru = 'ридер'"));
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.ФискальныйРегистратор,
		НСтр("ru = 'фискальный регистратор'"));
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.ПринтерЧеков,
		НСтр("ru = 'принтер чеков'"));
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.ЭквайринговыйТерминал,
		НСтр("ru = 'эквайринговый терминал'"));
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.ДисплейПокупателя, НСтр("ru = 'дисплей покупателя'"));
	СоответствиеОкончанияНаименования.Вставить(ТипыОборудования.ЭлектронныеВесы, НСтр("ru = 'весы-online'"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
